'''
Задача 2: Найдите сумму цифр трехзначного числа.
'''

x = input('Введие трехзначное число: ')
print(int(x[0]) + int(x[1]) + int(x[2]))